# A machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for following candidates.(Linear_Regression_multi _variable)

2 yr experience, 9 test score, 6 interview score

12 yr experience, 10 test score, 10 interview score

In [108]:
import pandas as pd
import numpy as np
from sklearn import linear_model
from word2number import w2n

In [109]:
df=pd.read_csv("hiring.csv")

In [110]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

# Data cleaning

Inserting "zero" in palce of NaN

In [111]:
df.experience=df.experience.fillna("zero")

In [112]:
df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [113]:
import math

In [114]:
median_test_score=math.floor(df['test_score(out of 10)'].median())
median_test_score

8

Taking mean of the test score column and adding the mean value in it.

In [115]:
mean_test_score=math.floor(df['test_score(out of 10)'].mean())
mean_test_score

7

In [116]:
df['test_score(out of 10)']=df['test_score(out of 10)'].fillna("7")
df['test_score(out of 10)']

0     8
1     8
2     6
3    10
4     9
5     7
6     7
7     7
Name: test_score(out of 10), dtype: object

In [117]:
df

   experience test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                     8                           9      50000
1           0                     8                           6      45000
2           5                     6                           7      60000
3           2                    10                          10      65000
4           7                     9                           6      70000
5           3                     7                          10      62000
6          10                     7                           7      72000
7          11                     7                           8      80000

In [118]:
X=df.drop(columns =["salary($)"])
X

   experience test_score(out of 10)  interview_score(out of 10)
0           0                     8                           9
1           0                     8                           6
2           5                     6                           7
3           2                    10                          10
4           7                     9                           6
5           3                     7                          10
6          10                     7                           7
7          11                     7                           8

In [119]:
y=df["salary($)"]

In [120]:
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary($), dtype: int64

In [121]:
from sklearn import linear_model
reg=linear_model.LinearRegression()
reg.fit(X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [122]:
reg.coef_

array([2922.26901502, 2221.30909959, 2147.48256637])

In [123]:
reg.intercept_

14992.651446693148

In [124]:
list(zip(X, reg.coef_))

[('experience', 2922.2690150210565),
 ('test_score(out of 10)', 2221.309099589095),
 ('interview_score(out of 10)', 2147.482566367156)]

In [125]:
from sklearn.model_selection import train_test_split

In [126]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2)

In [127]:
predictions=reg.predict(X_test)
predictions

array([60783.44785255, 45648.01964161])

In [128]:
X_test

   experience test_score(out of 10)  interview_score(out of 10)
5           3                     7                          10
1           0                     8                           6

Predicting values  for two  data:

2 yr experience, 9 test score, 6 interview score

12 yr experience, 10 test score, 10 interview score

In [129]:
predictions=reg.predict([[12,10,10],[2,9,6]])
predictions

array([93747.79628651, 53713.86677124])

In [130]:
df

   experience test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                     8                           9      50000
1           0                     8                           6      45000
2           5                     6                           7      60000
3           2                    10                          10      65000
4           7                     9                           6      70000
5           3                     7                          10      62000
6          10                     7                           7      72000
7          11                     7                           8      80000